mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xm/common/mb9bf56xm.h
typedef struct stc_can_msgval_field
{
        __IO  uint32_t  MSGVAL1                  :1;
        __IO  uint32_t  MSGVAL2                  :1;
        __IO  uint32_t  MSGVAL3                  :1;
        __IO  uint32_t  MSGVAL4                  :1;
        __IO  uint32_t  MSGVAL5                  :1;
        __IO  uint32_t  MSGVAL6                  :1;
        __IO  uint32_t  MSGVAL7                  :1;
        __IO  uint32_t  MSGVAL8                  :1;
        __IO  uint32_t  MSGVAL9                  :1;
        __IO  uint32_t  MSGVAL10                 :1;
        __IO  uint32_t  MSGVAL11                 :1;
        __IO  uint32_t  MSGVAL12                 :1;
        __IO  uint32_t  MSGVAL13                 :1;
        __IO  uint32_t  MSGVAL14                 :1;
        __IO  uint32_t  MSGVAL15                 :1;
        __IO  uint32_t  MSGVAL16                 :1;
        __IO  uint32_t  MSGVAL17                 :1;
        __IO  uint32_t  MSGVAL18                 :1;
        __IO  uint32_t  MSGVAL19                 :1;
        __IO  uint32_t  MSGVAL20                 :1;
        __IO  uint32_t  MSGVAL21                 :1;
        __IO  uint32_t  MSGVAL22                 :1;
        __IO  uint32_t  MSGVAL23                 :1;
        __IO  uint32_t  MSGVAL24                 :1;
        __IO  uint32_t  MSGVAL25                 :1;
        __IO  uint32_t  MSGVAL26                 :1;
        __IO  uint32_t  MSGVAL27                 :1;
        __IO  uint32_t  MSGVAL28                 :1;
        __IO  uint32_t  MSGVAL29                 :1;
        __IO  uint32_t  MSGVAL30                 :1;
        __IO  uint32_t  MSGVAL31                 :1;
        __IO  uint32_t  MSGVAL32                 :1;
} stc_can_msgval_field_t;

/*******************************************************************************
* CANPRES_MODULE
*******************************************************************************/
typedef struct stc_canpres_canpre_field
{
    union {
        struct {
            __IO   uint8_t  CANPRE               :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  CANPRE0              :1;
            __IO   uint8_t  CANPRE1              :1;
            __IO   uint8_t  CANPRE2              :1;
            __IO   uint8_t  CANPRE3              :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_canpres_canpre_field_t;

/*******************************************************************************
* CLK_GATING_MODULE
*******************************************************************************/
typedef struct stc_clk_gating_cken0_field
{
        __IO  uint32_t  MFSCK0                   :1;
        __IO  uint32_t  MFSCK1                   :1;
        __IO  uint32_t  MFSCK2                   :1;
        __IO  uint32_t  MFSCK3                   :1;
        __IO  uint32_t  MFSCK4                   :1;
        __IO  uint32_t  MFSCK5                   :1;
        __IO  uint32_t  MFSCK6                   :1;
        __IO  uint32_t  MFSCK7                   :1;
        __IO  uint32_t  MFSCK8                   :1;
        __IO  uint32_t  MFSCK9                   :1;
        __IO  uint32_t  MFSCK10                  :1;
        __IO  uint32_t  MFSCK11                  :1;
        __IO  uint32_t  MFSCK12                  :1;
        __IO  uint32_t  MFSCK13                  :1;
        __IO  uint32_t  MFSCK14                  :1;
        __IO  uint32_t  MFSCK15                  :1;
        __IO  uint32_t  ADCCK0                   :1;
        __IO  uint32_t  ADCCK1                   :1;
        __IO  uint32_t  ADCCK2                   :1;
        __IO  uint32_t  ADCCK3                   :1;
        __IO  uint32_t  RESERVED0                :4;
        __IO  uint32_t  DMACK                    :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  EXBCK                    :1;
        __IO  uint32_t  RESERVED2                :1;
        __IO  uint32_t  GIOCK                    :1;
        __IO  uint32_t  RESERVED3                :3;
} stc_clk_gating_cken0_field_t;

typedef struct stc_clk_gating_mrst0_field
{
        __IO  uint32_t  MFSRST0                  :1;
        __IO  uint32_t  MFSRST1                  :1;
        __IO  uint32_t  MFSRST2                  :1;
        __IO  uint32_t  MFSRST3                  :1;
        __IO  uint32_t  MFSRST4                  :1;
        __IO  uint32_t  MFSRST5                  :1;
        __IO  uint32_t  MFSRST6                  :1;
        __IO  uint32_t  MFSRST7                  :1;
        __IO  uint32_t  MFSRST8                  :1;
        __IO  uint32_t  MFSRST9                  :1;
        __IO  uint32_t  MFSRST10                 :1;
        __IO  uint32_t  MFSRST11                 :1;
        __IO  uint32_t  MFSRST12                 :1;
        __IO  uint32_t  MFSRST13                 :1;
        __IO  uint32_t  MFSRST14                 :1;
        __IO  uint32_t  MFSRST15                 :1;
        __IO  uint32_t  ADCRST0                  :1;
        __IO  uint32_t  ADCRST1                  :1;
        __IO  uint32_t  ADCRST2                  :1;
        __IO  uint32_t  ADCRST3                  :1;
        __IO  uint32_t  RESERVED0                :4;
        __IO  uint32_t  DMARST                   :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  EXBRST                   :1;
        __IO  uint32_t  RESERVED2                :5;
} stc_clk_gating_mrst0_field_t;

typedef struct stc_clk_gating_cken1_field
{
        __IO  uint32_t  BTMCK0                   :1;
        __IO  uint32_t  BTMCK1                   :1;
        __IO  uint32_t  BTMCK2                   :1;
        __IO  uint32_t  BTMCK3                   :1;
        __IO  uint32_t  RESERVED0                :4;
        __IO  uint32_t  MFTCK0                   :1;
        __IO  uint32_t  MFTCK1                   :1;
        __IO  uint32_t  MFTCK2                   :1;
        __IO  uint32_t  MFTCK3                   :1;
        __IO  uint32_t  RESERVED1                :4;
        __IO  uint32_t  QDUCK0                   :1;
        __IO  uint32_t  QDUCK1                   :1;
        __IO  uint32_t  QDUCK2                   :1;
        __IO  uint32_t  QDUCK3                   :1;
        __IO  uint32_t  RESERVED2                :12;
} stc_clk_gating_cken1_field_t;

typedef struct stc_clk_gating_mrst1_field
{
        __IO  uint32_t  BTMRST0                  :1;
        __IO  uint32_t  BTMRST1                  :1;
        __IO  uint32_t  BTMRST2                  :1;
        __IO  uint32_t  BTMRST3                  :1;
        __IO  uint32_t  RESERVED0                :4;
        __IO  uint32_t  MFTRST0                  :1;
        __IO  uint32_t  MFTRST1                  :1;
        __IO  uint32_t  MFTRST2                  :1;
        __IO  uint32_t  MFTRST3                  :1;
        __IO  uint32_t  RESERVED1                :4;
        __IO  uint32_t  QDURST0                  :1;
        __IO  uint32_t  QDURST1                  :1;
        __IO  uint32_t  QDURST2                  :1;
        __IO  uint32_t  QDURST3                  :1;
        __IO  uint32_t  RESERVED2                :12;
} stc_clk_gating_mrst1_field_t;

